
  <details>
  <summary>terraform/compartments - Terraform Plan Output (click to expand)</summary>
  
```
data.oci_identity_compartment.parent: Reading...
data.oci_identity_compartment.parent: Read complete after 1s [id=ocid1.compartment.oc1..aaaaaaaavjic26327yzpleqiu77qvfaxxjobtsuili265urpkh7ac63afo3q]
oci_identity_compartment.root: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaa5duoizz2qhnhvoxgzvlzw7rr2dsumwgjrat5fbmiyhguqa5a4rga]
oci_identity_compartment.core["mgmt"]: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaabzq7o6hdjsmpw7pl6osrewvyml5zcny2iplfiblxhlyht7ad2kwa]
oci_identity_compartment.core["open01"]: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaa63uxv3nbgblz5dakdctbdf3k7ac3jyur4ctq5fxvs5yhaoicihcq]
oci_identity_compartment.core["open02"]: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaak3jplcvfqofbm2uxsf6crcpcttnqtetewiilm2x2lntm5kmhqina]
oci_identity_compartment.core["open03"]: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaaiqtedavwrbtl4wia3huiijbm5niyw5pah5aehydnbw5dfn6b4foq]
oci_identity_compartment.core["hub"]: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaaehidqylcim37575lpyf7tkm57t3i4khinigekxmisow4gddw5nga]
oci_identity_compartment.core["security"]: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaausyin5bf3fpqpiajccmu7gypyovk5m4mo2tvozbyfx33m2mpjjmq]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # oci_identity_compartment.core["open04"] will be created
  + resource "oci_identity_compartment" "core" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaa5duoizz2qhnhvoxgzvlzw7rr2dsumwgjrat5fbmiyhguqa5a4rga"
      + defined_tags   = (known after apply)
      + description    = "Operating Entity 04 Compartment for the OpenLZ Project"
      + enable_delete  = false
      + freeform_tags  = {
          + "Project"   = "OpenLZ"
          + "Team"      = "Industry Cloud"
          + "Terraform" = "true"
        }
      + id             = (known after apply)
      + inactive_state = (known after apply)
      + is_accessible  = (known after apply)
      + name           = "cmp-open04"
      + state          = (known after apply)
      + time_created   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ core_compartments     = {
      + cmp-open04   = {
          + compartment_id = "ocid1.compartment.oc1..aaaaaaaa5duoizz2qhnhvoxgzvlzw7rr2dsumwgjrat5fbmiyhguqa5a4rga"
          + defined_tags   = (known after apply)
          + description    = "Operating Entity 04 Compartment for the OpenLZ Project"
          + enable_delete  = false
          + freeform_tags  = {
              + Project   = "OpenLZ"
              + Team      = "Industry Cloud"
              + Terraform = "true"
            }
          + id             = (known after apply)
          + inactive_state = (known after apply)
          + is_accessible  = (known after apply)
          + name           = "cmp-open04"
          + state          = (known after apply)
          + time_created   = (known after apply)
          + timeouts       = null
        }
        # (6 unchanged attributes hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan_output.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan_output.tfplan"

```
  </details>
